In [1]:
%load_ext sql

In [2]:
%sql sqlite:///AuctionBase.db

u'Connected: None@AuctionBase.db'

In [3]:
%sql select * from Users limit 4;

Done.

[(u'!peanut', 37, u'Arkansas', u'USA'),
 (u'$303', 534, u'merlin', u'USA'),
 (u'$4bob', 2747, u'Ash Flat, AR.', u'USA'),
 (u'$9.99', 204, u'PAYPAL OK', u'USA')]

In [4]:
%sql select * from Bids limit 4;

Done.

[(u'$4bob', 1496021639, u'2001-12-15 22:30:32', 4.86),
 (u'$4bob', 1676049878, u'2001-12-10 06:22:03', 6.33),
 (u'$4bob', 1677024023, u'2001-12-13 20:23:06', 22.5),
 (u'$9.99warehouse', 1309373684, u'2001-12-15 01:30:03', 37.5)]

In [5]:
%sql SELECT COUNT(*) from Users;

Done.

[(13422,)]

In [6]:
%%sql SELECT COUNT(*)
FROM Users
WHERE Location = 'New York';

Done.

[(80,)]

In [7]:
%%sql
SELECT COUNT(*)
FROM (
  SELECT ItemID
  FROM Category
  GROUP BY ItemID
  HAVING COUNT(Category) = 4
);

Done.

[(8365,)]

In [14]:
%%sql 
select ItemID
from Items
where Currently=(select MAX(Currently) from Items);

Done.

[(1046871451,)]